{
    "title": "Front-End Developer, Creative and Marketing",
    "company": "LEVEL",
    "location": "Anywhere",
    "description": "Company Description\n\nFor 25 years, Level has developed marketing solutions for some of the world’s most innovative brands. We believe the best solutions come from collaborative working partnerships with our clients. Whether an established brand, or a start-up, we believe in the power of creative strategy, design, and technology to solve business challenges.\n\nOverview\n\nLevel Studios is seeking a mid-level Front-End Developer to support the creation, enhancement, and updating of innovative and unique product/marketing pages and web applications for our consumer electronics client.\n\nAre you a passionate front-end developer with exceptional HTML, CSS, and JavaScript skills? Do you have experience collaborating with cross-functional teams, clients, and stakeholders to iterate on the solutions you build? Do you want to partner with a world-class team to create and deliver high-quality, pixel-perfect interactive digital experiences seen by millions? If so, let’s talk about the exciting opportunities at Level Studios as we tackle increasingly complex digital client engagements!\n\nThe primary technical toolkit for this role will be HTML, CSS, Javascript, Handlebars, SASS, and GIT; experience with the Greensock animation library is preferred. Other modern development tools such as Three.JS, React, and Node may also be leveraged.\n\nPlease Note\n• This role is based out of our San Francisco office and candidates should expect to work Pacific Time hours.\n• The majority of the work can be completed remotely but some occasional onsite collaboration may be required. Therefore, candidates local to the Bay Area (including San Jose, Santa Clara, Sunnyvale, and similar surrounding locations) will be prioritized but highly qualified candidates in other markets may also be considered.\n\nResponsibilities\n• Develop and maintain custom frameworks and design systems that power some of the world’s most visible website experiences.\n• Build custom tools to support development processes.\n• Contribute to existing SASS and JavaScript libraries used at scale.\n• Maintain and expand documentation for custom frameworks.\n• Collaborate and ideate on new features for existing systems.\n• Work with the creative team to enhance application design across multiple platforms.\n• Build detailed and performant JavaScript interactions using vanilla JavaScript.\n• Work closely and collaboratively with team members across multiple disciplines.\n• Develop and deliver high-quality code to create new features and resolve bugs in clients’ custom frameworks, including both the Core library and the Editor GUI.\n• Review requirements with the client's framework DRI, partners, and clients as needed to ensure proper understanding and execution.\n• Partner with the QE team to ensure high-quality test plans and proper coverage of framework features.\n• Support the creation of a device/performance catalog for real-time WebGL experiences based on parameters defined by the team.\n• Partner with various teams and stakeholders to iterate and collaborate on existing and upcoming development projects\n\nQualifications\n• There is no specific educational requirement for this role\n• 3-5 years of prior front-end development experience is required; prior experience working alongside a marketing or creative team in a consultancy, advertising agency, or large, complex corporate environment is strongly preferred\n• Deep experience working on .com projects including innovative and unique product/marketing pages and web applications\n• Strong proficiency in writing custom vanilla JavaScript from scratch without the need for libraries and experience modifying or extending existing JavaScript modules and manipulating DOM elements\n• Extensive experience developing in front-end languages including HTML, CSS, Javascript, Handlebars, SASS, GIT, WebGL, ThreeJS, and React; experience with the Greensock animation library strongly preferred.\n• Experience with other modern frontend development tools with NodeJS such as Gulp, Yarn, and/or Webpack would be ideal\n• Familiarity with Adobe Creative Suite, particularly Photoshop\n• Prior experience presenting and explaining work in various stages of completion\n• Knowledge of best practices in building fluid/responsive layouts\n• Experience using Chrome or Safari Dev Tools for inspecting and debugging client-side code\n• Strong knowledge of browser compatibility, including mobile web browsers, and their rendering engines\n• Experience with localization and right to left languages is a plus\n• Familiarity with Mac OS X including working in the UNIX terminal\n• Strong interpersonal, written, and verbal communication skills\n• Self-directed and independent with outstanding organizational and time management skills as well as a meticulous attention to detail\n• Ability to work across multiple concurrent projects in a fast-paced, deadline-driven, continuously-evolving environment\n• Code samples may be required as a part of the hiring process\n\nAdditional Information\n\nThe Power of One starts with our people! To do powerful things, we offer powerful resources. Our best-in-class wellness and benefits offerings include:\n• Paid Family Care for parents and caregivers for 12 weeks or more\n• Monetary assistance and support for Adoption, Surrogacy and Fertility\n• Monetary assistance and support for pet adoption\n• Employee Assistance Programs and Health/Wellness/Comfort reimbursements to help you invest in your future and work/life balance\n• Tuition Assistance\n• Paid time off that includes Flexible Time off Vacation, Annual Sick Days, Volunteer Days, Holiday and Identity days, and more\n• Matching Gifts programs\n• Flexible working arrangements\n• ‘Work Your World’ Program encouraging employees to work from anywhere Publicis Groupe has an office for up to 6 weeks a year (based upon eligibility)\n• Business Resource Groups that support multiple affinities and alliances\n\nThe benefits offerings listed are available to eligible U.S. Based employees, are reviewed on an annual basis, and are governed by the terms of the applicable plan documents.\n\nLevel Studios is an Equal Opportunity Employer. Our employment decisions are made without regard to actual or perceived race, color, ethnicity, religion, creed, sex, sexual orientation, gender, gender identity, gender expression, pregnancy, childbirth and related medical conditions, national origin, ancestry, citizenship status, age, disability, medical condition as defined by applicable state law, genetic information, marital status, military service and veteran status, or any other characteristic protected by applicable federal, state or local laws and ordinances.\n\nIf you require accommodation or assistance with the application or onboarding process specifically, please contact USMSTACompliance@publicis.com. All your information will be kept confidential according to EEO guidelines.\n\nCompensation Range: $73,150-$96,200 annually. This is the pay range the Company believes it will pay for this position at the time of this posting. Consistent with applicable law, compensation will be determined based on the skills, qualifications, and experience of the applicant along with the requirements of the position, and the Company reserves the right to modify this pay range at any time. Temporary roles may be eligible to participate in our freelancer/temporary employee medical plan through a third-party benefits administration system once certain criteria have been met. Temporary roles may also qualify for participation in our 401(k) plan after eligibility criteria have been met. For regular roles, the Company will offer medical coverage, dental, vision, disability, 401k, and paid time off. The Company anticipates the application deadline for this job posting will be 1/5/2026.",
    "url": "https://www.linkedin.com/jobs/view/front-end-developer-creative-and-marketing-at-level-4349546722?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "apply_url": "https://www.linkedin.com/jobs/view/front-end-developer-creative-and-marketing-at-level-4349546722?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_posted": "5 days ago",
    "platform": "LinkedIn",
    "job_type": "Full-time",
    "is_real_job": true,
    "sort_date": "2025-12-11 00:01:04",
    "date_saved": "2025-12-16 00:01:04"
}