{
    "title": "Software Engineer- Remote within Cleveland, OH, Atlanta, GA or Austin, TX",
    "company": "OEC",
    "location": "Anywhere",
    "description": "OEC provides software solutions to those who work in the automotive parts and repair industry. Our solutions make it easier for automotive industry professionals to buy and sell parts, conduct repair research & planning, optimize estimates, improve the parts supply chain, and more. OEC partners with many of the world’s largest manufacturers, dealers and suppliers, shops and repairers, and service providers, giving our customers access to a comprehensive network and a streamlined workflow.\n\nJob Summary/Objective\n\nDevelops effective information technology solutions for OEC by creating new, or enhancing existing internal or customer applications. Applies solid and fundamental concepts of software programming and application development methodology in a team environment. Determines programming solutions from analyzing business and functional requirements and technical specifications.\n\nKey Responsibilities & Duties (essential To The Job)\n• Performs code development, product design, and programming activities requiring business, functional and systems research and analysis. Designs, implements, and/or maintains product modules or sub-systems.\n• Sets production processes, and follows scheduled plans and timelines, utilizing established programming/development guidelines to meet key activity goals.\n• Leverages existing code or utilities and seeks opportunities for reuse.\n• Offers production support as aligned with service level agreements. Participates in post-production support.\n• Interacts regularly with functional teams, including (but not limited to) Marketing, Product, Customer Care, and Quality to gather and disseminate information regarding product builds and progress.\n• Executes test procedures according to test plan and identifies problems; performs unit and integration testing for functionality and limits; performs bug verification, release testing, and support for assigned products.\n• Writes module-level implementation and test specifications; tracks key activities.\n• Participates in product deploys.\n• Estimates development changes and ensures all stakeholders are apprised of effort and duration for each development task.\n• Generates accurate code for new or existing models/routines or complex redesigns.\n• Assists with monitoring, maintaining and developing QA environments.\n• Reviews test cases/plans and assists with migration contingency plans.\n• Reports on project management milestones, and works with or escalates issues to senior level.\n\nEducation\n\nA bachelor’s degree from an accredited college or university is required, with a focus in Technology, Computer Science, or related discipline. In the absence of a degree, equivalent work experience directly related to the key responsibilities of the role will be considered as a substitute for the degree.\n\nExperience, Skills And Key Competencies\n\nAt least 3 years of software development experience with a proven background in writing increasingly complex code and providing input into the design phase.\n\nMust also be able to demonstrate the following skills and abilities:\n• 3–5 years of professional experience in software development, including full-stack work.\n• Proficiency in .NET (C#) for backend services and APIs.\n• Experience with Angular, React, or similar modern front-end frameworks.\n• Familiarity with RESTful APIs, relational databases (e.g., SQL Server, PostgreSQL), and common software patterns.\n• *\n• Ability to complete work from team’s board, regardless of technology stack.\n• Fundamental understanding of architecture and infrastructure principles.\n• Can define and resolve intermediate to complex issues at their root cause.\n• Able to troubleshoot across technology stacks.\n• Works well within the team, with the ability to work independently to resolve issues.\n• Able to quickly learn and demonstrate solid knowledge of OEC products.\n• Flexible and adaptable approach to work, and can easily adjust to shifts in priorities as the needs of the business change.\n\nWhat makes working at OEC awesome? It varies from employee to employee. For some, it's the flexibility - whether it's remote work or a hybrid or in-person role, OEC takes our teams across multiple time zones and international communities. For others, it's the strong sense of camaraderie and community that celebrates both individuals and team-driven contributions. Or it could be the empowerment and how the team is encouraged to take risks, learn, and grow within a dynamic and supportive environment. But no matter what gets us out of bed in the morning, our whole global community is inspired to be forward thinking and drive innovative solutions for the automotive parts and repair industry.\n\nOEConnection is subject to certain governmental recordkeeping and reporting requirements for the administration of civil rights laws and regulations. In order to comply with these laws, we invite applicants and employees to voluntarily self-identify their gender, race and ethnicity. Submission of this information is strictly voluntary and refusal to provide it will not subject you to any adverse treatment. The information obtained will be kept confidential and may only be used in accordance with the provision of applicable laws, executive orders, and regulations, including those that require the information to be summarized and reported to the federal government for civil rights enforcement. When reported, data will not identify any specific individual. This information will be maintained separately from your application for employment. If you do not wish to self-identify at this time, you may do so in the future by submitting this form. Failure to provide the following information will not subject you to any adverse action or treatment. OEConnection is an Equal Opportunity/ Affirmative Action employer. We provide equal employment opportunities to all qualified employees and applicants for employment without regard to race, religion, sex, age, marital status, national origin, sexual orientation, citizenship status, veteran status, disability or any other legally protected status. We prohibit discrimination in decisions concerning recruitment, hiring, compensation, benefits, training, termination, promotions, or any other condition of employment or career development.",
    "url": "https://www.linkedin.com/jobs/view/software-engineer-remote-within-cleveland-oh-atlanta-ga-or-austin-tx-at-oec-4296655341?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "apply_url": "https://www.linkedin.com/jobs/view/software-engineer-remote-within-cleveland-oh-atlanta-ga-or-austin-tx-at-oec-4296655341?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_posted": "Recent",
    "platform": "LinkedIn",
    "job_type": "Full-time",
    "is_real_job": true,
    "sort_date": "2024-12-16 00:02:30",
    "date_saved": "2025-12-16 00:02:30"
}