{
    "title": "Staff Software Engineer - Remote (Expertise with Go, TypeScript and Exp in R&D Roles)",
    "company": "MillenniumSoft Inc",
    "location": "Anywhere",
    "description": "Position : Staff Software Engineer - Remote (Strong expertise with Go, TypeScript and Exp in Research & Development roles)\n\nLocation : San Diego, CA\n\nDuration : 12 Months\n\nTotal Hours/week : 40.00\n\n1st Shift\n\nClient : Medical Devices Company\n\nJob Category : Engineer\n\nLevel of Experience : Senior Level\n\nEmployment Type : Contract on W2 (Need US Citizens or GC Holders or GC EAD or OPT or EAD or CPT)\n\nJob Description\n• Client Software Technology Solutions (STS) division seeks a hands-on Staff Engineer, passionate about developing and maintaining a best-in-class cloud-native Reporting and Analytics platform.\n• This position requires an enthusiastic technical leader to work across the entire stack, building highly scalable next generation Business Intelligence, Reporting and Analytics cloud-based solutions.\n• Individual in this highly collaborative position will partner with and advise multiple teams by guiding the creation and consumption of services.\n\nKey Responsibilities\n• Participate in all aspects of agile software development of cloud-native modular components, including design, testing, implementation, deployment, and production support.\n• Drive agile development methodologies, adhering to best practices and pursuing continued learning opportunities.\n• Guide designing and building end-to-end systems optimized for performance, scale, and reliability.\n• Ensure application performance, uptime, and scale.\n• Maintain high standards for code quality and application design.\n• Develop deployment automation using DevOps principles.\n• Work with source code management tools (e.g. GitHub) and work tracking tools (e.g. Jira).\n• Collaborate across time zones via MS Teams, GitHub PR comments, and online documentation.\n• Enhance professional growth and development through participation in educational programs, current literature, in-service meetings, and workshops. Required Skills and Qualifications\n• At least 7+ years of experience in building large-scale software applications.\n• Minimum 3-5+ years of experience with cloud SaaS development.\n• Experience in designing and building serverless cloud solutions with AWS is a must (EC2, lambda, step functions, event-driven architecture).\n• Must have 3-5 years of experience running and supporting production systems on AWS.\n• Strong hands-on development expertise with Go, TypeScript, Makefile, JavaScript, Shell, HTML, and React.\n• Experience in designing and integrating RESTful APIs.\n• Must have good coding practices, including well-documented code.\n• A foundation in Clean Code, the SOLID principles and DORA is desired.\n• Excellent debugging and optimization skills.\n• Experience in unit/integration testing.\n• Experience working with Business Intelligence and analytics tools, such as ThoughtSpot, is preferred.\n• Experience with multiple database implementations (e.g. SQL, Athena, Redshift, DynamoDB, Hudi) is preferred.\n• Strong written and oral communication skills required.\n• Experience interacting with global teams is a strong plus.\n\nEducation And Experience Required\n• Bachelor’s degree in computer science or a related field required. Master's or advanced degree strongly preferred.\n• At least 7 years of growing responsibility in Research & Development roles.",
    "url": "https://www.linkedin.com/jobs/view/staff-software-engineer-remote-expertise-with-go-typescript-and-exp-in-r-d-roles-at-millenniumsoft-inc-4072954350?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "apply_url": "https://www.linkedin.com/jobs/view/staff-software-engineer-remote-expertise-with-go-typescript-and-exp-in-r-d-roles-at-millenniumsoft-inc-4072954350?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_posted": "Recent",
    "platform": "LinkedIn",
    "job_type": "Full-time",
    "is_real_job": true,
    "sort_date": "2024-12-16 00:01:58",
    "date_saved": "2025-12-16 00:01:58"
}